prst/TMS320F28xxx/n5110.c
/* ************************************************************************** */
/*
 * Описание     : Это драйвер для графического LCD от Nokia 5110, а также его китайских клонов.
 * Автор        : Xander Gresolio <xugres@gmail.com>
 * Веб-страница : https://github.com/gresolio/N3310Lib
 * Лицензия     : GPL v3.0
 * Оптимизация  : kobzar aka kobraz для http://cxem.net/ maodzedun@gmail.com
 */
/* ************************************************************************** */

/* ************************************************************************** */
#include "stddef.h"
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include "string.h"

#include "init.h"

#if (1==__AVR__)
#include <avr/interrupt.h>
#include "n5110.h"
#endif //(1==__AVR__)

#if (1==__TMS320__)
#include "n5110.h"
#include "5110.h"
//#include "F2802x_Device.h"
#include "include/F2802x_Device.h"     // DSP2802x Headerfile Include File
#endif //(1==__TMS320__)

/* ************************************************************************** */

#if (1==__USE_LCD_5110__)


/* ************************************************************************** */
// j6   | pin   |
// -----+-------+---------------------------------------------------------------
// RST  | GPIO0 |   сброс
// CE   | GPIO1 |   включение
// DC   | GPIO2 |   Команда / данные
// SDIN | GPIO3 |   Последовательный ввод данных
// SCLK | GPIO4 |   последовательный ввод тактов
/* ************************************************************************** */


/* ************************************************************************** */
// Прототипы приватных функций драйвера
/* ************************************************************************** */
static void LcdSend    ( byte data, LcdCmdData cd );
static void Delay_lcd5510      ( void );
/* ************************************************************************** */


/* ************************************************************************** */
// Глобальные переменные
/* ************************************************************************** */
// Кэш в ОЗУ 84*48 бит или 504 байта
static byte  LcdCache [ LCD_CACHE_SIZE ];
/* ************************************************************************** */


/* ************************************************************************** */
// Чтобы не обновлять весь дисплей, а лишь ту часть что изменилась,
// будем отмечать две границы кэша где произошли изменения. Затем
// можно копировать эту часть кэша между границами в ОЗУ дисплея.
/* ************************************************************************** */
static int   LoWaterMark;   // нижняя граница
static int   HiWaterMark;   // верхняя граница
/* ************************************************************************** */


/* ************************************************************************** */
// Указатель для работы с LcdCache[]
/* ************************************************************************** */
static int   LcdCacheIdx;
/* ************************************************************************** */


/* ************************************************************************** */
// Флаг изменений кэша
/* ************************************************************************** */
static byte  UpdateLcd;
/* ************************************************************************** */

unsigned char ArrayDisplay[LCD_X_RES];



/* ==========================================================================
 * NAME - Wrapper_LCD_Print
 * IN   - void
 * OUT  - void
 * RET  - void
   ========================================================================== */
void Wrapper_LCD_Print ( void ) {
/*
	Lcd_prints(0, 0, FONT_1X, "~" );
	Lcd_prints(1, 0, FONT_1X, "Hello world!" );
	Lcd_prints(1, 1, FONT_1X, "It's working." );
	Lcd_prints(1, 2, FONT_1X, "uschema.com" );
	Lcd_prints(1, 3, FONT_1X, "Станислав" );
	Lcd_prints(1, 4, FONT_1X, "Приходько" );
	Lcd_prints(1, 5, FONT_1X, "TMS320F28027." );
*/
	/*byte strings[6][14] = {
		"Hello world! ",
		"It's working.",
		"uschema.com  ",
		"Станислав    ",
		"Приходько    ",
		"TMS320F28027."
	};
	byte nn;

	for (nn=0; nn<6; nn++) {
		Lcd_prints(1, nn, FONT_1X, &strings[nn][0] );
	}*/

	//Lcd_rect_empty ( 0, 8, 8, LCD_X_RES-1, PIXEL_XOR);
	//Lcd_rect ( 0, 8, 8, LCD_X_RES-1, PIXEL_XOR);
	//Lcd_line( 20, 8, 30, 16, PIXEL_ON );
	//Lcd_circle ( 3, 4, 1, PIXEL_ON );

	memset (ArrayDisplay, 16, LCD_X_RES);
	ShowDisplayFromBufferByVertical( ArrayDisplay, 1/*K=0..1*/ );
	//Lcd_update();
}



/* ************************************************************************** */
/*
 * Имя                   : ShowDisplayFromBuffer
 * Описание              : Производит вывод данных на LCD целиком с буффера
 * Аргумент(ы)           : Нет
 * Возвращаемое значение : Нет
 */
/* ************************************************************************** */
int ShowDisplayFromBufferByVertical( unsigned char *pArrayDisplay, float zoom )
{
	byte  x_line = 0, y_offset;

	for ( x_line=0; x_line<LCD_X_RES; x_line++ ) {
	  //pArrayDisplay+=x_line;
	  y_offset = LCD_Y_RES - pArrayDisplay[x_line]*zoom;
	  pArrayDisplay[x_line] = 10;
	  Lcd_line (
	    /*x1*/x_line, /*y1*/y_offset,
	    /*x2*/x_line, /*y2*/LCD_Y_RES,
	    PIXEL_ON
	  );
	}
	return 0;
}



/* ************************************************************************** */
/*
 * Имя                   : Lcd_init
 * Описание              : Производит инициализацию порта и SPI МК, контроллера LCD
 * Аргумент(ы)           : Нет
 * Возвращаемое значение : Нет
 */
/* ************************************************************************** */
void Lcd_init ( void ) {
#if (1==__AVR__)
    // Pull-up на вывод подключенный к reset дисплея
    LCD_PORT |= _BV ( LCD_RST_PIN );

    // Устанавливаем нужные биты порта на выход
    LCD_DDR |= _BV( LCD_RST_PIN ) | _BV( LCD_DC_PIN ) | _BV( LCD_CE_PIN ) | _BV( SPI_MOSI_PIN ) | _BV( SPI_CLK_PIN );

    // Некалиброванная задержка
    Delay_lcd5510();

    // Дергаем reset
    LCD_PORT &= ~( _BV( LCD_RST_PIN ) );
    Delay_lcd5510();
    LCD_PORT |= _BV ( LCD_RST_PIN );

    // Активируем SPI:
    // без прерываний, старший бит первый, режим мастера, CPOL->0, CPHA->0, Clk/4
    SPCR = 0x50;

    // Отключаем LCD контроллер - высокий уровень на SCE
    LCD_PORT |= _BV( LCD_CE_PIN );

    // Отправляем команды дисплею
    LcdSend ( 0x21, LCD_CMD ); // Включаем расширенный набор команд (LCD Extended Commands)
    LcdSend ( 0xC8, LCD_CMD ); // Установка контрастности (LCD Vop)
    LcdSend ( 0x06, LCD_CMD ); // Установка температурного коэффициента (Temp coefficent)
    LcdSend ( 0x13, LCD_CMD ); // Настройка питания (LCD bias mode 1:48)
    LcdSend ( 0x20, LCD_CMD ); // Включаем стандартный набор команд и горизонтальную адресацию (LCD Standard Commands,Horizontal addressing mode)
    LcdSend ( 0x0C, LCD_CMD ); // Нормальный режим (LCD in normal mode)

