prst/TMS320F28xxx/n5110.c
    // Первичная очистка дисплея
    Lcd_clear();
    Lcd_update();
#endif //(1==__AVR__)

#if (1==__TMS320__)
    rst_l;           // Reset (2) 0 OXFD = 11111101
    DELAY(10);       // задержка 5us
    rst_h;           // Reset (2) 1

    ce_l;            // чип включить (3) 0, открытая 0xFB = 11111011
    DELAY(0);        // задержка 5us
    ce_h;            // чип рядом


    /*
     """ sets the LCD contrast """
     command([0x21, 0x14, value, 0x20, 0x0c])
     */

    // Отправляем команды дисплею
    // ........................................................................
    // Включаем расширенный набор команд (LCD Extended Commands)
    // создание команд
    // 0x21 = 00100001 - Normal
    // 0b00000001 -
    // 0b00000010 -
    // 0b00000100 -
    // 0b00001000 - Mirror Y
    // 0b00010000 - Mirror X
    // 0b00100000 - 1
    // 0b01000000 -
    // 0b10000000 -
    write_com(0x33);

    // Установка контрастности (LCD Vop)
    // 0xC8 = 11001000 - Normal
    // 0b00000001 -
    // 0b00000010 -
    // 0b00000100 -
    // 0b00001000 -
    // 0b00010000 -
    // 0b00100000 -
    // 0b01000000 -
    // 0b10000000 -
    write_com(0xc0);

    // Установка температурного коэффициента (Temp coefficent)
    // 0x06 = 00000110 - Normal
    // 0b00000001 -
    // 0b00000010 -
    // 0b00000100 -
    // 0b00001000 -
    // 0b00010000 -
    // 0b00100000 -
    // 0b01000000 -
    // 0b10000000 -
    write_com(0x07);

    // Настройка питания (LCD bias mode 1:48)
    // 0x13 = 00010011 - Normal
    // 0b00000001 -
    // 0b00000010 -
    // 0b00000100 -
    // 0b00001000 -
    // 0b00010000 - Light
    // 0b00100000 - Light
    // 0b01000000 - Light
    // 0b10000000 - Light
    write_com(0x13);

    // Включаем стандартный набор команд и горизонтальную адресацию
    // (LCD Standard Commands,Horizontal addressing mode)
    // 0x20 - Normal
    // основной набор команд.
    // 0b00000001 -
    // 0b00000010 -
    // 0b00000100 -
    // 0b00001000 - Mirror Y
    // 0b00010000 - Mirror X
    // 0b00100000 -
    // 0b01000000 -
    // 0b10000000 -
    write_com(0x30);

    // Нормальный режим (LCD in normal mode)
    // Обычный режим 12 (0x0c) = 00001100
    // 0b00000001 - Inversion
    // 0b00000010 -
    // 0b00000100 - Normal text
    // 0b00001000 - Normal text
    // 0b00010000 -
    // 0b00100000 -
    // 0b01000000 -
    // 0b10000000 -
    write_com(0x0c); // color Normal
    // write_com(0x0d); // color Inverted
    // ........................................................................

    lcd_clear();

    ce_l;            // чип позволит 0xFB = 11111011
#endif //(1==__TMS320__)
}
/* ************************************************************************** */


/* ************************************************************************** */
/*
 * Имя                   :  Lcd_clear
 * Описание              :  Очищает дисплей. Далее необходимо выполнить LcdUpdate
 * Аргумент(ы)           :  Нет
 * Возвращаемое значение :  Нет
 */
/* ************************************************************************** */
void Lcd_clear ( void ) {
    memset ( LcdCache,  0x00,  LCD_CACHE_SIZE );
    
    // Сброс указателей границ в максимальное значение
    LoWaterMark = 0;
    HiWaterMark = LCD_CACHE_SIZE - 1;

    // Установка флага изменений кэша
    UpdateLcd = TRUE;
}
/* ************************************************************************** */



/* ************************************************************************** */
/*
 * Имя                   : Lcd_update
 * Описание              : Копирует кэш в ОЗУ дисплея
 * Аргумент(ы)           : Нет
 * Возвращаемое значение : Нет
 */
/* ************************************************************************** */
void Lcd_update (void) {
    int i;

    if ( LoWaterMark < 0 )
        LoWaterMark = 0;
    else if ( LoWaterMark >= LCD_CACHE_SIZE )
        LoWaterMark = LCD_CACHE_SIZE - 1;

    if ( HiWaterMark < 0 )
        HiWaterMark = 0;
    else
    	if ( HiWaterMark >= LCD_CACHE_SIZE )
    		HiWaterMark = LCD_CACHE_SIZE - 1;

    #ifdef CHINA_LCD  // Алгоритм для китайского ЖК из нестандартным контроллером

        byte x,y;

        // 102 x 64 - таково предполагаемое разрешение буфера китайского ЖК, при чем
        // память буфера отображается на дисплей со сдвигом вверх на 3 пикселя.
        // Поэтому выводим картинку ниже - начиная с второй строки y+1, а потом
        // сдвинем вверх (опять таки фича китайца, полезная в данном случае)
                
        x = LoWaterMark % LCD_X_RES;      // Устанавливаем начальный адрес x
        LcdSend( 0x80 | x, LCD_CMD );     // относительно нижней границы LoWaterMark
        
        y = LoWaterMark / LCD_X_RES + 1;  // Устанавливаем начальный адрес y+1
        LcdSend( 0x40 | y, LCD_CMD );     // относительно нижней границы LoWaterMark

        for ( i = LoWaterMark; i <= HiWaterMark; i++ )
        {
            // передаем данные в буфер дисплея
            LcdSend( LcdCache[i], LCD_DATA );
            
            x++;                 // заодно подсчитываем координату x, чтобы вовремя перейти на новую строку
            if (x >= LCD_X_RES)  // если вышли за предел, то переходим на следующую строку (x=0; y++)
            {
                // проще говоря, чтобы верно заполнить нужную часть нестандартного буфера,
                // придется явно указывать требуемый адрес, иначе все поплывет :)
                x=0;                
                LcdSend( 0x80, LCD_CMD );
                y++;
                LcdSend( 0x40 | y, LCD_CMD );
            }
        }

        LcdSend( 0x21, LCD_CMD );    // Включаем расширенный набор команд
        LcdSend( 0x45, LCD_CMD );    // Сдвигаем картинку на 5 пикселей вверх (нестандартная команда китайца, оригинал её игнорирует)
        LcdSend( 0x20, LCD_CMD );    // Включаем стандартный набор команд и горизонтальную адресацию

    #else  // Алгоритм для оригинального дисплея

        // Устанавливаем начальный адрес в соответствии к LoWaterMark
        LcdSend( 0x80 | ( LoWaterMark % LCD_X_RES ), LCD_CMD );
        LcdSend( 0x40 | ( LoWaterMark / LCD_X_RES ), LCD_CMD );

