prst/TMS320F28xxx/n5110.c
        // Обновляем необходимую часть буфера дисплея
        for ( i = LoWaterMark; i <= HiWaterMark; i++ ) {
            // Для оригинального дисплея не нужно следить за адресом в буфере,
            // можно просто последовательно выводить данные
            LcdSend( LcdCache[i], LCD_DATA );
        }

    #endif

    // Сброс указателей границ в пустоту
    LoWaterMark = LCD_CACHE_SIZE - 1;
    HiWaterMark = 0;

    // Сброс флага изменений кэша
    UpdateLcd = FALSE;
}
/* ************************************************************************** */


#if (1==__AVR__)
#endif //(1==__AVR__)
#if (1==__TMS320__)
#endif //(1==__TMS320__)
/* ************************************************************************** */
/*
 * Имя                   : LcdSend
 * Описание              : Отправляет данные в контроллер дисплея
 * Аргумент(ы)           : data -> данные для отправки
 *                         cd   -> команда или данные (смотри enum в n5110.h)
 * Возвращаемое значение : Нет
 */
/* ************************************************************************** */
static void LcdSend ( byte data, LcdCmdData cd ) {
#if (1==__AVR__)
    // Включаем контроллер дисплея (низкий уровень активный)
    LCD_PORT &= ~( _BV( LCD_CE_PIN ) );

    if ( cd == LCD_DATA ) {
        LCD_PORT |= _BV( LCD_DC_PIN );
    } else {
        LCD_PORT &= ~( _BV( LCD_DC_PIN ) );
    }

    // Отправка данных в контроллер дисплея
    SPDR = data;

    // Ждем окончания передачи
    while ( (SPSR & 0x80) != 0x80 );

    // Отключаем контроллер дисплея
    LCD_PORT |= _BV( LCD_CE_PIN );
#endif //(1==__AVR__)

#if (1==__TMS320__)
    // Включаем контроллер дисплея (низкий уровень активный)
    ce_l; // чип включить (3) 0, открытая 0xFB = 11111011

    if ( cd == LCD_DATA ) {
    	write_data(data);
    } else {
    	write_com(data);
    }

    // Отключаем контроллер дисплея
    ce_h; // чип включить (3) 0, открытая 0xFB = 11111011
#endif //(1==__TMS320__)
}
/* ************************************************************************** */


/* ************************************************************************** */
/*
 * Имя                   : LcdContrast
 * Описание              : Устанавливает контрастность дисплея
 * Аргумент(ы)           : контраст -> значение от 0x00 к 0x7F
 * Возвращаемое значение : Нет
 */
/* ************************************************************************** */
void LcdContrast ( byte contrast ) {
    LcdSend( 0x21, LCD_CMD );              // Расширенный набор команд
    LcdSend( 0x80 | contrast, LCD_CMD );   // Установка уровня контрастности
    LcdSend( 0x20, LCD_CMD );              // Стандартный набор команд, горизонтальная адресация
}
/* ************************************************************************** */


/* ************************************************************************** */
/*
 * Имя                   : Delay
 * Описание              : Некалиброванная задержка для процедуры инициализации LCD
 * Аргумент(ы)           : Нет
 * Возвращаемое значение : Нет
 */
/* ************************************************************************** */
static void Delay_lcd5510 ( void ) {
    int i;
    for ( i = -32000; i < 32000; i++ ) { };
}
/* ************************************************************************** */


/* ************************************************************************** */
/*
 * Имя                   : LcdGotoXY
 * Описание              : Устанавливает курсор в позицию x,y относительно стандартного размера шрифта
 * Аргумент(ы)           : x,y -> координаты новой позиции курсора. Значения: 0,0 .. 13,5
 * Возвращаемое значение : смотри возвращаемое значение в n5110.h
 */
/* ************************************************************************** */
byte LcdGotoXY ( byte x, byte y ) {
    // Проверка границ
    if ( x > 13 || y > 5 ) return OUT_OF_BORDER;

    //  Вычисление указателя. Определен как адрес в пределах 504 байт
    LcdCacheIdx = x * 6 + y * 84;

    return OK;
}
/* ************************************************************************** */


/* ************************************************************************** */
/*
 * Имя                   : LcdChr
 * Описание              : Выводит символ в текущей позиции курсора, затем инкрементирует положение курсора
 * Аргумент(ы)           : size -> размер шрифта. Смотри enum в n5110.h
 *                         ch   -> символ для вывода
 * Возвращаемое значение : смотри возвращаемое значение в n5110lcd.h
 */
/* ************************************************************************** */
byte LcdChr ( LcdFontSize size, byte ch ) {
    byte i, c;
    byte b1, b2;
    int  tmpIdx;

    if ( LcdCacheIdx < LoWaterMark ) {
        // Обновляем нижнюю границу
        LoWaterMark = LcdCacheIdx;
    }

    if ( (ch >= 0x20) && (ch <= 0x7F) ) {
        // Смещение в таблице для символов ASCII[0x20-0x7F]
        ch -= 32;
    } else if ( ch >= 0xC0 ) {
        // Смещение в таблице для символов CP1251[0xC0-0xFF]
        ch -= 96;
    } else {
        // Остальные игнорируем (их просто нет в таблице для экономии памяти)
        ch = 95;
    }

    if ( size == FONT_1X ) {
        for ( i = 0; i < 5; i++ ) {
            // Копируем вид символа из таблицы в кэш
            LcdCache[LcdCacheIdx++] = pgm_read_byte( &(FontLookup[ch][i]) ) << 1;
        }
    } else if ( size == FONT_2X ) {
        tmpIdx = LcdCacheIdx - 84;

        if ( tmpIdx < LoWaterMark ) {
            LoWaterMark = tmpIdx;
        }

        if ( tmpIdx < 0 )  return OUT_OF_BORDER;

        for ( i = 0; i < 5; i++ ) {
            // Копируем вид символа из таблицы у временную переменную
            c = pgm_read_byte(&(FontLookup[ch][i])) << 1;
            // Увеличиваем картинку
            // Первую часть
            b1 =  (c & 0x01) * 3;
            b1 |= (c & 0x02) * 6;
            b1 |= (c & 0x04) * 12;
            b1 |= (c & 0x08) * 24;

            c >>= 4;
            // Вторую часть
            b2 =  (c & 0x01) * 3;
            b2 |= (c & 0x02) * 6;
            b2 |= (c & 0x04) * 12;
            b2 |= (c & 0x08) * 24;

