prst/TMS320F28xxx/n5110.c
            // Копируем две части в кэш
            LcdCache[tmpIdx++] = b1;
            LcdCache[tmpIdx++] = b1;
            LcdCache[tmpIdx + 82] = b2;
            LcdCache[tmpIdx + 83] = b2;
        }

        // Обновляем x координату курсора
        LcdCacheIdx = (LcdCacheIdx + 11) % LCD_CACHE_SIZE;
    }

    if ( LcdCacheIdx > HiWaterMark ) {
        // Обновляем верхнюю границу
        HiWaterMark = LcdCacheIdx;
    }

    // Горизонтальный разрыв между символами
    LcdCache[LcdCacheIdx] = 0x00;

    // Если достигли позицию указателя LCD_CACHE_SIZE - 1, переходим в начало
    if(LcdCacheIdx == (LCD_CACHE_SIZE - 1) ) {
        LcdCacheIdx = 0;
        return OK_WITH_WRAP;
    }

    // Иначе просто инкрементируем указатель
    LcdCacheIdx++;
    return OK;
}


/* ************************************************************************** */
/*
 * Имя                   : Lcd_print
 * Описание              : Эта функция предназначена для печати строки из переменной
 * Аргумент(ы)           : size      -> размер шрифта. Смотри enum в n5110.h
 *                       : dataArray -> массив содержащий строку которую нужно напечатать
 *						 : x,y -> координаты
 * Возвращаемое значение : смотри возвращаемое значение в n5110lcd.h
 * Пример                : LcdFStr(0, 0, FONT_1X,(unsigned char*)some_char);
 *                         LcdFStr(0, 0, FONT_1X, &name_of_string_as_array);
 */
/* ************************************************************************** */
byte Lcd_print ( byte x, byte y, LcdFontSize size, byte dataArray[] ) {
	LcdGotoXY(x,y);
    byte tmpIdx=0;
    byte response;
    while( dataArray[ tmpIdx ] != '\0' ) {
        // Выводим символ
        response = LcdChr( size, dataArray[ tmpIdx ] );

        // Не стоит волноваться если произойдет OUT_OF_BORDER,
        // строка будет печататься дальше из начала дисплея
        if( response == OUT_OF_BORDER)  return OUT_OF_BORDER;

        // Увеличиваем указатель
        tmpIdx++;
    }
    return OK;
}
/* ************************************************************************** */



/* ************************************************************************** */
/*
 * Имя                   : Lcd_prints
 * Описание              : Эта функция предназначена для печати статичной строки
 * Аргумент(ы)           : size    -> размер шрифта. Смотри enum в n5110.h
 *                         dataPtr -> указатель на строку которую нужно напечатать
 *						 : x,y -> координаты
 * Возвращаемое значение : смотри возвращаемое значение в n5110lcd.h
 * Пример                : LcdFStr(0, 0, FONT_1X, PSTR("Hello World"));
 *                         LcdFStr(0, 0, FONT_1X, &name_of_string_as_array);
 */
/* ************************************************************************** */
byte Lcd_prints ( byte x, byte y, LcdFontSize size, const byte *dataPtr ) {
    LcdGotoXY(x,y);

	byte c;
    byte response;

    //for ( c = pgm_read_byte(dataPtr); c; ++dataPtr, c=pgm_read_byte(dataPtr) )
    for ( c = pgm_read_byte(dataPtr); c; ++dataPtr, c=pgm_read_byte(dataPtr) )
    {
        // Выводим символ
        response = LcdChr( size, c );
        if ( response == OUT_OF_BORDER ) return OUT_OF_BORDER;
    }

    return OK;
}
/* ************************************************************************** */


/* ************************************************************************** */
/*
 * Имя                   : Lcd_printf
 * Описание              : Эта функция предназначена для печати числа с плавающей запятой
 * Аргумент(ы)           : size      -> размер шрифта. Смотри enum в n5110.h
 *                       : data -> число
 *						 : accuracy -> число знаков после запятой
 *						 : x,y -> координаты
 * Возвращаемое значение : смотри возвращаемое значение в n5110lcd.h
 * Пример                : LcdFStr(0, 0, FONT_1X, float_var , 2);
 *                         LcdFStr(0, 0, FONT_1X, &name_of_string_as_array);
 */
/* ************************************************************************** */
void Lcd_printf ( byte x, byte y, LcdFontSize size, float data, int accuracy ) {
	Lcd_print ( x, y, size, (unsigned char*)gftoa(data, accuracy) );
}
/* ************************************************************************** */


/* ************************************************************************** */
/*
 * Имя                   : Lcd_pixel
 * Описание              : Отображает пиксель по абсолютным координатам (x,y)
 * Аргумент(ы)           : x,y  -> абсолютные координаты пикселя
 *                         mode -> Off, On или Xor. Смотри enum в n5110.h
 * Возвращаемое значение : смотри возвращаемое значение в n5110lcd.h
 */
/* ************************************************************************** */
byte Lcd_pixel ( byte x, byte y, LcdPixelMode mode ) {
    int  index;
    byte  offset;
    byte  data;

    // Защита от выхода за пределы
    if ( x >= LCD_X_RES || y >= LCD_Y_RES) return OUT_OF_BORDER;

    // Пересчет индекса и смещения
    index = ( ( y / 8 ) * 84 ) + x;
    offset  = y - ( ( y / 8 ) * 8 );

    data = LcdCache[ index ];

    // Обработка битов

    // Режим PIXEL_OFF
    if ( mode == PIXEL_OFF ) {
        data &= ( ~( 0x01 << offset ) );
    }
    // Режим PIXEL_ON
    else if ( mode == PIXEL_ON ) {
        data |= ( 0x01 << offset );
    }
    // Режим PIXEL_XOR
    else if ( mode  == PIXEL_XOR ) {
        data ^= ( 0x01 << offset );
    }

    // Окончательный результат копируем в кэш
    LcdCache[ index ] = data;

    if ( index < LoWaterMark ) {
        // Обновляем нижнюю границу
        LoWaterMark = index;
    }

    if ( index > HiWaterMark ) {
        // Обновляем верхнюю границу
        HiWaterMark = index;
    }

    return OK;
}
/* ************************************************************************** */



/* ************************************************************************** */
/*
 * Имя                   : Lcd_line
 * Описание              : Рисует линию между двумя точками на дисплее (алгоритм Брезенхэма)
 * Аргумент(ы)           : x1, y1  -> абсолютные координаты начала линии
 *                         x2, y2  -> абсолютные координаты конца линии
 *                         mode    -> Off, On или Xor. Смотри enum в n5110.h
 * Возвращаемое значение : смотри возвращаемое значение в n5110lcd.h
 */
/* ************************************************************************** */
byte Lcd_line ( byte x1, byte y1, byte x2, byte y2, LcdPixelMode mode ) {
    int dx, dy, stepx, stepy, fraction;
    byte response;

    // dy   y2 - y1
    // -- = -------
    // dx   x2 - x1

    dy = y2 - y1;
    dx = x2 - x1;

    // dy отрицательное
    if ( dy < 0 ) {
        dy    = -dy;
        stepy = -1;
    } else {
        stepy = 1;
    }

    // dx отрицательное
    if ( dx < 0 ) {
        dx    = -dx;
        stepx = -1;
    } else {
        stepx = 1;
    }

